In [1]:
import psycopg2
import pandas as pd

conn = psycopg2.connect(dbname = 'opportunity_youth')

In [11]:
pd.read_sql("""
SELECT table_name
FROM information_schema.tables
WHERE table_type='BASE TABLE'
AND table_schema='public';""", conn)

        table_name
0        pums_2017
1  puma_names_2010
2     wa_jobs_2017
3     wa_geo_xwalk
4    ct_puma_xwalk

In [138]:
sum_by = 'w_geocode'

pd.read_sql(f"""SELECT {sum_by}, SUM(ca01)
                FROM wa_jobs_2017 jobs
                JOIN wa_geo_xwalk geo
                ON jobs.w_geocode = geo.tabblk2010
                JOIN ct_puma_xwalk puma
                ON geo.trct = CONCAT(puma.statefp, puma.countyfp, puma.tractce)
                WHERE puma5ce between '11610' and '11615'
                GROUP BY {sum_by}""", conn)

            w_geocode  sum
0     530330109001029  203
1     530330251011000    0
2     530330251011003   43
3     530330251011004   30
4     530330251011005   30
...               ...  ...
4132  530330321024012    2
4133  530330321024014    4
4134  530330321024015    1
4135  530330321024017    2
4136  530330321024021    1

[4137 rows x 2 columns]

In [131]:
pd.read_sql("""SELECT puma5ce, SUM(ca01)
               FROM wa_jobs_2017 jobs
               JOIN wa_geo_xwalk geo
               ON jobs.w_geocode = geo.tabblk2010
               JOIN ct_puma_xwalk puma
               ON geo.trct = CONCAT(puma.statefp, puma.countyfp, puma.tractce)
               WHERE puma5ce between '11610' and '11615'
               GROUP BY puma5ce""", conn)

  puma5ce    sum
0   11610   8289
1   11611  25568
2   11612   9096
3   11613  14723
4   11614  12036
5   11615   5621